trade_exp/src/Catalogs/МаркетинговыеМероприятия/МаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c73091d4-df84-416b-b922-292bad652bcb">
    <name>ВидАкции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ae9479-c571-4679-84b4-7b266d558aa3">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc28c861-b1f1-4634-9c0b-44ce86962cc5">
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08fbba43-8d05-4b08-9fdc-4b1752590134">
    <name>Завершено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15a17d46-90e2-4b4f-aff8-97f6003b84e9">
    <name>ПлановаяДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85ac9f24-3837-4782-a585-56a0d879b1e6">
    <name>ПлановаяДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="39107d04-fe7d-4b1d-89e3-dd5ab7328e09">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7e3491f-fa5c-4f9b-845d-3fc9d2e74e76">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37ce1685-dc81-4c83-8c8d-41c951b3174f">
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1646f0d-1858-4e3b-aeba-44c3c6abc7a4">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c67c05fb-234f-4b67-bb6c-3d22c4fd239b">
    <name>Алгоритм</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d833614f-4c8d-4905-aff5-99423da2d475">
    <name>Промокод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75a918bd-beee-43f3-a18d-0d1f5a06d59b">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfc3f2b2-ba4e-4175-baa3-51b75736bf1b">
    <name>ТипОтбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee72e673-d0fa-4062-b4db-48866b97ec94">
    <name>БюджетАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47182116-8c5d-43df-9acd-c16a17e02949">
    <name>ТипОтбораПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="b1aa65f9-8969-4429-82be-1d3696361de3">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0df12fc9-5869-4c64-892b-69872209a792">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04054850-afc8-46e1-8838-58b9a799d9f3">
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="357743e8-165c-4eeb-918c-ee282061e1d4">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d602f20-0a08-45e4-9ea8-d3509b5ffcad">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4662048c-988b-40e1-9c1b-d22e9a883984">
    <name>ТоварыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9b9b5f85-9670-470a-9686-c6df882241af">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c59564d8-df31-4aa6-b19d-2fff746be329">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1239bbd5-f2e0-4cd4-a620-0d3528a66025">
      <name>Процент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9e1db591-e524-4dd2-8d94-7f801ba78ebb">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77141400-a5cb-47a5-a8cc-d87a803174d7">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00659616-12e6-49ba-ac39-a7e437c8d9a9">
      <name>ГруппаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7e74afc2-2a2b-4a56-a6a4-35b421968295">
    <name>Действия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="aafec904-8da8-4417-8eda-c15e474197a7">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d62d74a0-fa15-4567-ad4a-bd1b6e299029">
    <name>ПартнерыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ed678a6-0e10-4705-89e4-699d8b6c84fd">
      <name>СегментПартнеров</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09e18e44-8c22-4194-9df6-0805c09c69cb">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d55e3f2b-4f2f-4a72-9410-92dbffff7e08">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="61ab45fc-991f-464a-815e-f62615097e77">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2a4dea56-afad-464b-9da1-6c1850af97a4">
    <name>Подразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91264b70-5b30-44c8-8b78-9db5998692ce">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/МаркетинговыеМероприятия/ObjectModule.bsl
&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	//+доработка выгрузки акций, пока не применять
	//Если Не Отказ Тогда
	//	Если Не ПометкаУдаления И Не Завершено И ВидАкции = Перечисления.ВидыАкций.Неликвиды Тогда
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ТЗ.Номенклатура КАК Номенклатура,
	//		|	ТЗ.Подразделение КАК Подразделение
	//		|ПОМЕСТИТЬ ВТ_ТЗ
	//		|ИЗ
	//		|	&ТЗ КАК ТЗ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
	//		|	ВТ_ТЗ.Подразделение.ИДМагазина КАК ИДМагазина
	//		|ИЗ
	//		|	ВТ_ТЗ КАК ВТ_ТЗ";
	//		Запрос.УстановитьПараметр("ТЗ", ТоварыАкции.Выгрузить()); 
	//		Выборка = Запрос.Выполнить().Выбрать();;
	//		
	//		
	//		Пока Выборка.Следующий() Цикл
	//			Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("NAZVANIE_AKTSII_" + Выборка.ИДМагазина);
	//			Если Свойство.Пустая() Тогда
	//				Название = "NAZVANIE_AKTSII_" + Выборка.ИДМагазина;
	//				ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	//				ДопРеквизит.Заголовок = Название;
	//				ДопРеквизит.Имя = Название;
	//				ДопРеквизит.Наименование = Название;
	//				ДопРеквизит.ИдентификаторДляФормул = Название;
	//				ДопРеквизит.Виден = Истина;
	//				ДопРеквизит.Доступен = Истина;
	//				ДопРеквизит.ДополнительныеЗначенияИспользуются = Истина;
	//				ДопРеквизит.Записать();
	//			    Свойство = ДопРеквизит.Ссылка;
	//			КонецЕсли; 
	//			ЗначениеСвойства = АльтерраОбщегоНазначения.ПолучитьДобавитьЗначениеСвойства(Свойство,Наименование);
	//			СвойствоНоменклатуры = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизитПоСвойству(Выборка.Номенклатура,Свойство);
	//			Если Не ЗначениеСвойства = СвойствоНоменклатуры Тогда
	//				АльтерраОбщегоНазначения.УстановитьДополнительныйРеквизитПоСвойству(Выборка.Номенклатура,Свойство,ЗначениеСвойства);
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	//-

	
	Если Не Отказ Тогда
		Если Не ПометкаУдаления И Не Завершено И ВидАкции = Перечисления.ВидыАкций.Неликвиды Тогда
			Свойство= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Название акции");
			ЗначениеСвойства = АльтерраОбщегоНазначения.ПолучитьДобавитьЗначениеСвойства(Свойство,Наименование);
			Для каждого Строка из ТоварыАкции Цикл
				СвойствоНоменклатуры = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизитПоСвойству(Строка.Номенклатура,Свойство);
				Если Не ЗначениеСвойства = СвойствоНоменклатуры Тогда
				АльтерраОбщегоНазначения.УстановитьДополнительныйРеквизитПоСвойству(Строка.Номенклатура,Свойство,ЗначениеСвойства);
			    КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	
	Если ВидАкции = Перечисления.ВидыАкций.Алгоритм И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена дата окончания акции");
	КонецЕсли;
	
	Если Не Отказ Тогда
		УдалитьПустыеСтрокиВСпискеПодразделений();
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьПустыеСтрокиВСпискеПодразделений()
	Для Каждого Стр Из Подразделения Цикл
		Если Не ЗначениеЗаполнено(Стр.Подразделение) Тогда
			Подразделения.Удалить(Стр);
			УдалитьПустыеСтрокиВСпискеПодразделений();
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
